In [1]:
import pandas as pd

In [2]:
df1= pd.read_csv(r"C:\Users\raina\python\My_program\CODE\Titanic\titanic_dataset.csv", index_col= 0)
print(df1)

      pclass  survived                                             name  \
0          1         1                    Allen, Miss. Elisabeth Walton
1          1         1                   Allison, Master. Hudson Trevor
2          1         0                     Allison, Miss. Helen Loraine
3          1         0             Allison, Mr. Hudson Joshua Creighton
4          1         0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
...      ...       ...                                              ...
1304       3         0                             Zabour, Miss. Hileni
1305       3         0                            Zabour, Miss. Thamine
1306       3         0                        Zakarian, Mr. Mapriededer
1307       3         0                              Zakarian, Mr. Ortin
1308       3         0                               Zimmerman, Mr. Leo

      gender      age  sibsp  parch  ticket      fare    cabin embarked boat  \
0     female  29.0000      0      0   24160  $211.34        B5        S    2
1       male   0.9167      1      2  113781  $151.55   C22 C26        S   11
2     female   2.0000      1      2  113781  $151.55   C22 C26        S  NaN
3       male  30.0000      1      2  113781  $151.55   C22 C26        S  NaN
4     female  25.0000      1      2  113781  $151.55   C22 C26        S  NaN
...      ...      ...    ...    ...     ...       ...      ...      ...  ...
1304  female  14.5000      1      0    2665   $14.45       NaN        C  NaN
1305  female      NaN      1      0    2665   $14.45       NaN        C  NaN
1306    male  26.5000      0      0    2656    $7.23       NaN        C  NaN
1307    male  27.0000      0      0    2670    $7.23       NaN        C  NaN
1308    male  29.0000      0      0  315082    $7.88       NaN        S  NaN

       body                        home.dest
0       NaN                     St Louis, MO
1       NaN  Montreal, PQ / Chesterville, ON
2       NaN  Montreal, PQ / Chesterville, ON
3     135.0  Montreal, PQ / Chesterville, ON
4       NaN  Montreal, PQ / Chesterville, ON
...     ...                              ...
1304  328.0                              NaN
1305    NaN                              NaN
1306  304.0                              NaN
1307    NaN                              NaN
1308    NaN                              NaN

[1309 rows x 14 columns]

In [93]:
print(df1.describe() )

            pclass     survived          age        sibsp        parch  \
count  1309.000000  1309.000000  1046.000000  1309.000000  1309.000000
mean      2.294882     0.381971    29.881135     0.498854     0.385027
std       0.837836     0.486055    14.413500     1.041658     0.865560
min       1.000000     0.000000     0.166700     0.000000     0.000000
25%       2.000000     0.000000    21.000000     0.000000     0.000000
50%       3.000000     0.000000    28.000000     0.000000     0.000000
75%       3.000000     1.000000    39.000000     1.000000     0.000000
max       3.000000     1.000000    80.000000     8.000000     9.000000

             body
count  121.000000
mean   160.809917
std     97.696922
min      1.000000
25%     72.000000
50%    155.000000
75%    256.000000
max    328.000000

# Find columns with missingdata

In [94]:

print(df1.isnull().any())

pclass       False
survived     False
name         False
gender       False
age           True
sibsp        False
parch        False
ticket       False
fare          True
cabin         True
embarked      True
boat          True
body          True
home.dest     True
dtype: bool

# Print shape of dataset

In [4]:
print(df1.shape)

(1309, 14)
1309

# rop columns with more than 25% missing data

In [96]:
df1.dropna(thresh = df1.shape[0]*0.25,how= 'any',axis= 1,inplace = True)
print(df1)
print(df1.shape)

      pclass  survived                                             name  \
0          1         1                    Allen, Miss. Elisabeth Walton
1          1         1                   Allison, Master. Hudson Trevor
2          1         0                     Allison, Miss. Helen Loraine
3          1         0             Allison, Mr. Hudson Joshua Creighton
4          1         0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
...      ...       ...                                              ...
1304       3         0                             Zabour, Miss. Hileni
1305       3         0                            Zabour, Miss. Thamine
1306       3         0                        Zakarian, Mr. Mapriededer
1307       3         0                              Zakarian, Mr. Ortin
1308       3         0                               Zimmerman, Mr. Leo

      gender      age  sibsp  parch  ticket      fare embarked boat  \
0     female  29.0000      0      0   24160  $211.34         S    2
1       male   0.9167      1      2  113781  $151.55         S   11
2     female   2.0000      1      2  113781  $151.55         S  NaN
3       male  30.0000      1      2  113781  $151.55         S  NaN
4     female  25.0000      1      2  113781  $151.55         S  NaN
...      ...      ...    ...    ...     ...       ...      ...  ...
1304  female  14.5000      1      0    2665   $14.45         C  NaN
1305  female      NaN      1      0    2665   $14.45         C  NaN
1306    male  26.5000      0      0    2656    $7.23         C  NaN
1307    male  27.0000      0      0    2670    $7.23         C  NaN
1308    male  29.0000      0      0  315082    $7.88         S  NaN

                            home.dest
0                        St Louis, MO
1     Montreal, PQ / Chesterville, ON
2     Montreal, PQ / Chesterville, ON
3     Montreal, PQ / Chesterville, ON
4     Montreal, PQ / Chesterville, ON
...                               ...
1304                              NaN
1305                              NaN
1306                              NaN
1307                              NaN
1308                              NaN

[1309 rows x 12 columns]
(1309, 12)

# drop columns having independent values(which do not affect the survival rate).

In [ ]:
df1.drop(columns = ['name','boat','home.dest','ticket'], inplace = True)

# check data types of all columns

In [104]:
print(df1.dtypes)

pclass        int64
survived      int64
gender       object
age         float64
sibsp         int64
parch         int64
fare        float64
embarked     object
dtype: object

# convert price to numeric

In [ ]:
#df1["fare"] = df1.fare.astype(int)
#df1.astype({'fare': 'int32'}).dtypes
df1['fare'] =  pd.to_numeric(df1['fare'].str.replace(r'[$]',''))

# ill na with mean for fare and age column column

In [107]:
df1.fillna({'age': df1.age.mean() , 'fare':df1.fare.mean()})
#print(df1)
print(df1.iloc[1294,:])

pclass         3
survived       0
gender      male
age         28.5
sibsp          0
parch          0
fare        16.1
embarked       S
Name: 1294, dtype: object

# find columns still having missing/na values and also count of missing data

In [108]:
print(df1.isna)

<bound method DataFrame.isna of       pclass  survived  gender      age  sibsp  parch    fare embarked
0          1         1  female  29.0000      0      0  211.34        S
1          1         1    male   0.9167      1      2  151.55        S
2          1         0  female   2.0000      1      2  151.55        S
3          1         0    male  30.0000      1      2  151.55        S
4          1         0  female  25.0000      1      2  151.55        S
...      ...       ...     ...      ...    ...    ...     ...      ...
1304       3         0  female  14.5000      1      0   14.45        C
1305       3         0  female      NaN      1      0   14.45        C
1306       3         0    male  26.5000      0      0    7.23        C
1307       3         0    male  27.0000      0      0    7.23        C
1308       3         0    male  29.0000      0      0    7.88        S

[1309 rows x 8 columns]>

# drop na values for embarked column.

In [112]:

df1.dropna(subset= ['embarked'], inplace = True)

# dump the dataframe to a csv file 'titanic_filtered.csv'.

In [117]:
df1.to_csv(r"C:\Users\raina\python\aish\titanic_filtered.csv", index = False)

# or surviced column replace 0 with D and 1 with A

In [131]:
#df1['survived'].astype(str).str.replace('0','D').replace('1', 'A')
df1['survived'].replace({1:'A',0: 'D'}, inplace = True )

# find the frequency of different values in survived column

In [132]:
df1.survived.value_counts()

D    809
A    498
Name: survived, dtype: int64

# group by gender and survived and see the counts in each category

In [174]:
grp = df1.groupby(by = 'gender' )
print(grp)
print(grp.groups)
print(grp.gender.count())

print()
print()

print()

grp1 = df1.groupby(by = 'survived' )
print(grp1)
print(grp1.groups)
grp1.survived.count()

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001F873A9EAF0>
{'female': Int64Index([   0,    2,    4,    6,    8,   11,   12,   13,   17,   18,
            ...
            1265, 1267, 1273, 1276, 1279, 1286, 1290, 1300, 1304, 1305],
           dtype='int64', length=464), 'male': Int64Index([   1,    3,    5,    7,    9,   10,   14,   15,   16,   19,
            ...
            1296, 1297, 1298, 1299, 1301, 1302, 1303, 1306, 1307, 1308],
           dtype='int64', length=843)}
gender
female    464
male      843
Name: gender, dtype: int64



<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001F873AB08B0>
{'A': Int64Index([   0,    1,    5,    6,    8,   11,   12,   13,   14,   17,
            ...
            1254, 1256, 1257, 1258, 1260, 1261, 1277, 1286, 1290, 1300],
           dtype='int64', length=498), 'D': Int64Index([   2,    3,    4,    7,    9,   10,   15,   16,   19,   25,
            ...
            1298, 1299, 1301, 1302, 1303, 1304, 1305, 1306, 1307, 1308],
           dtype='int64', length=809)}

survived
A    498
D    809
Name: survived, dtype: int64

# find different pclass and no of people in each class

In [146]:
df1.pclass.value_counts()

3    709
1    321
2    277
Name: pclass, dtype: int64

# find top 5 people with highest values of age. Count no of male and females in the top 5

In [177]:
r = df1.sort_values(by = 'age' , ascending = False ).head(5)
print(r)
print()
grp= r.groupby('gender')
grp.gender.count()

      pclass survived  gender   age  sibsp  parch   fare embarked
14         1        A    male  80.0      0      0  30.00        S
61         1        A  female  76.0      1      0  78.85        S
1235       3        D    male  74.0      0      0   7.78        S
135        1        D    male  71.0      0      0  34.65        C
9          1        D    male  71.0      0      0  49.50        C

gender
female    1
male      4
Name: gender, dtype: int64

# get average age by gender

In [196]:
grp = df1.groupby('gender').age.mean()
print(grp)

gender
female    28.576641
male      30.585233
Name: age, dtype: float64

# find max age male and female who survived

In [195]:
r = df1.loc[df1['survived'] == 'A']
grp = r.groupby('gender')
grp.age.max()

gender
female    76.0
male      80.0
Name: age, dtype: float64

# get average age by people survived vs not-survived

In [203]:
r1  = df1.loc[df1['survived']=='A']
r2  = df1.loc[df1['survived']=='D']
print("average age alived people ",r1.age.mean())
print("Average age of dead people ",r2.age.mean())
print()

#df1.loc[df1['survived']=='A'].age.mean()
#df1.loc[df1['survived']=='D'].age.mean()

average age alived people  28.81901976470588
Average age of dead people  30.54536882067851

30.54536882067851